Ran Plan for 2 projects:

1. project: `infradev` dir: `infraeks` workspace: `dev`
1. project: `infraprod` dir: `infraeks` workspace: `prod`

### 1. project: `infradev` dir: `infraeks` workspace: `dev`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_vpc.example will be created
+ resource "aws_vpc" "example" {
      + arn                                  = (known after apply)
      + cidr_block                           = "30.0.0.0/28"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "env"  = "dev-vpc"
          + "name" = "dev-vpc"
        }
      + tags_all                             = {
          + "env"  = "dev-vpc"
          + "name" = "dev-vpc"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p infradev`
* :put_litter_in_its_place: To **delete** this plan click [here](https://455f-142-93-45-192.eu.ngrok.io/lock?id=mjgit007%252Feks_sample%252Finfraeks%252Fdev)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p infradev`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. project: `infraprod` dir: `infraeks` workspace: `prod`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_vpc.example will be created
+ resource "aws_vpc" "example" {
      + arn                                  = (known after apply)
      + cidr_block                           = "30.0.0.0/28"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "env"  = "prod-vpc"
          + "name" = "dev-vpc"
        }
      + tags_all                             = {
          + "env"  = "prod-vpc"
          + "name" = "dev-vpc"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p infraprod`
* :put_litter_in_its_place: To **delete** this plan click [here](https://455f-142-93-45-192.eu.ngrok.io/lock?id=mjgit007%252Feks_sample%252Finfraeks%252Fprod)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p infraprod`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
